{
  "subject": "ELA",
  "grade": 6,
  "version": "2025.10.10",
  "standards": [
    {
      "code": "ELA.6.C.1.2",
      "name": "Write personal or fictional narratives using narrative techniques, precise words and phrases, and figurative language.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to write narratives using techniques like dialogue and pacing.",
          "Students will be able to incorporate figurative language into their writing."
        ],
        "teacher_friendly": "Focus on the elements of a story (plot, character, setting) and encourage students to use descriptive language and literary devices to make their writing more engaging.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Write a short story from the perspective of an object in the room."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "writing",
          "narrative"
        ]
      }
    },
    {
      "code": "ELA.6.C.1.3",
      "name": "Write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, and a logical organizational structure with varied transitions.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to write a clear claim.",
          "Students will be able to support a claim with evidence and reasoning."
        ],
        "teacher_friendly": "Teach a basic argumentative structure: claim, evidence, and reasoning. Emphasize the importance of using credible sources to support their arguments.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Argue whether or not students should be required to wear school uniforms, using evidence from two articles."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "writing",
          "argumentative",
          "claim",
          "evidence"
        ]
      }
    },
    {
      "code": "ELA.6.C.1.4",
      "name": "Write expository texts to explain and/or analyze information from multiple sources, using a logical organizational structure, relevant elaboration, and varied transitions.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to write informative/explanatory texts to convey information clearly.",
          "Students will be able to synthesize information from multiple sources."
        ],
        "teacher_friendly": "Focus on organizational structures for explanatory writing, such as compare/contrast or cause/effect. Teach students how to paraphrase and cite information from sources.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Write an essay explaining the causes of the American Revolution."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "writing",
          "expository",
          "informative"
        ]
      }
    },
    {
      "code": "ELA.6.C.1.5",
      "name": "Improve writing by planning, revising, and editing, considering feedback from adults and peers.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to use the writing process (planning, drafting, revising, editing) to improve their work.",
          "Students will be able to incorporate feedback from others."
        ],
        "teacher_friendly": "Emphasize that writing is a process. Teach specific strategies for revising (improving ideas and organization) and editing (fixing grammar and spelling). Use peer review activities.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "writing",
          "writing process",
          "revision",
          "editing"
        ]
      }
    },
    {
      "code": "ELA.6.C.2.1",
      "name": "Present information orally, in a logical sequence, using nonverbal cues, appropriate volume, clear pronunciation, and appropriate pacing.",
      "internal": {
        "clarifications": [
          "Nonverbal cues include posture, tone, expressive delivery, focus on the audience, and facial expression.",
          "Appropriate pacing means adhering to pauses dictated by punctuation and speaking at a rate that facilitates comprehension."
        ],
        "objectives": [
          "Students will be able to deliver a well-organized oral presentation.",
          "Students will be able to use effective speaking skills (volume, pacing, eye contact)."
        ],
        "teacher_friendly": "Provide students with a simple rubric for oral presentations that includes criteria for content, organization, and delivery skills. Give opportunities for practice in a low-stakes environment.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "speaking and listening",
          "presentation"
        ]
      }
    },
    {
      "code": "ELA.6.C.3.1",
      "name": "Follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level.",
      "internal": {
        "clarifications": [
          "Skills to be mastered include using verbals (gerunds, infinitives, participial phrases), comparative and superlative adjectives, and correcting for vague pronoun reference."
        ],
        "objectives": [
          "Students will be able to apply grade-level grammar and conventions in their writing.",
          "Students will be able to identify and correct errors in pronoun usage and adjective forms."
        ],
        "teacher_friendly": "Integrate grammar instruction with writing. Use mini-lessons to focus on specific skills, such as vague pronouns, and have students practice by editing their own and others' work.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Correct the sentence: 'When Maria and her friend arrived, she was happy.'"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "grammar",
          "conventions"
        ]
      }
    },
    {
      "code": "ELA.6.C.4.1",
      "name": "Conduct research to answer a question, drawing on multiple reliable and valid sources, and refocusing the inquiry when appropriate.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to conduct research to answer a question.",
          "Students will be able to use multiple reliable sources."
        ],
        "teacher_friendly": "Teach students how to formulate a research question and how to evaluate the credibility of sources (e.g., checking the author and domain). Guide them in synthesizing information from different sources.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "research",
          "sources"
        ]
      }
    },
    {
      "code": "ELA.6.C.5.1",
      "name": "Integrate diverse digital media to enhance audience engagement in oral or written tasks.",
      "internal": {
        "clarifications": [
          "Multimedia elements should add new information to the presentation, not just restate or reinforce it."
        ],
        "objectives": [
          "Students will be able to incorporate multimedia (images, videos, audio) into their presentations."
        ],
        "teacher_friendly": "Encourage students to use multimedia elements that add value and are not just decorative. For example, a short video clip that illustrates a concept or a chart that visualizes data.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "technology",
          "multimedia",
          "presentations"
        ]
      }
    },
    {
      "code": "ELA.6.C.5.2",
      "name": "Use digital tools to produce writing.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to use digital tools like word processors to create and format written work."
        ],
        "teacher_friendly": "Guide students in using the features of digital writing tools, such as spell check, formatting options, and tools for collaboration and sharing.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "technology",
          "digital tools",
          "writing"
        ]
      }
    },
    {
      "code": "ELA.6.R.1.1",
      "name": "Analyze how the interaction between characters contributes to the development of a plot in a literary text.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to explain how character actions and relationships drive the plot forward."
        ],
        "teacher_friendly": "Have students track how a main character's choices and their interactions with other characters cause key events to happen in the story.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "How does the conflict between the protagonist and antagonist move the story's plot?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "literary elements",
          "character",
          "plot"
        ]
      }
    },
    {
      "code": "ELA.6.R.1.2",
      "name": "Analyze the development of stated or implied theme(s) throughout a literary text.",
      "internal": {
        "clarifications": [
          "Theme is not a one- or two-word topic, but a complete thought that communicates the author's message.",
          "Students should be introduced to the concept of universal themes, which are ideas that apply to anyone, anywhere, regardless of cultural differences.",
          "Examples include an individual's struggle toward understanding, the conflict between humans and technology, the impact of the past on the present, the struggle for equality, and the loss of innocence."
        ],
        "objectives": [
          "Students will be able to identify the theme of a literary text.",
          "Students will be able to trace how the theme is developed through characters, plot, and setting."
        ],
        "teacher_friendly": "Explain that theme is the 'message' of the story. Help students move from a one-word topic (e.g., 'friendship') to a complete thematic statement (e.g., 'True friendship requires sacrifice').",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "What is the theme of 'The Tortoise and the Hare'?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "literary elements",
          "theme"
        ]
      }
    },
    {
      "code": "ELA.6.R.1.3",
      "name": "Explain the influence of multiple narrators and/or shifts in point of view in a literary text.",
      "internal": {
        "clarifications": [
          "'Point of view' refers to the person of the narrator, and students should differentiate it from 'perspective,' which was a focus in fifth grade."
        ],
        "objectives": [
          "Students will be able to explain how seeing a story from different points of view affects the reader's understanding."
        ],
        "teacher_friendly": "Use texts that have multiple narrators or chapters that shift point of view. Discuss with students: What information do we get from one narrator that we don't get from another? How does this create suspense or irony?",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "literary elements",
          "point of view",
          "perspective"
        ]
      }
    },
    {
      "code": "ELA.6.R.1.4",
      "name": "Describe the impact of various poetic forms on meaning and style.",
      "internal": {
        "clarifications": [
          "Poetic forms for this standard are sonnet and villanelle."
        ],
        "objectives": [
          "Students will be able to identify the characteristics of a sonnet and a villanelle.",
          "Students will be able to describe how the structure of a poem affects its meaning."
        ],
        "teacher_friendly": "Introduce the basic rules of sonnets (14 lines, specific rhyme scheme) and villanelles (repetition of lines). Discuss how the strict form of a sonnet can impact its message, or how the repetition in a villanelle creates a certain mood.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "poetry",
          "form",
          "sonnet",
          "villanelle"
        ]
      }
    },
    {
      "code": "ELA.6.R.2.1",
      "name": "Explain how individual text sections and/or features convey meaning in texts.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to explain the purpose of text features like headings, charts, and diagrams.",
          "Students will be able to explain how specific paragraphs or sections contribute to the overall text."
        ],
        "teacher_friendly": "In informational texts, ask students questions like 'Why did the author include this photograph?' or 'How does this heading help you understand what this section is about?'",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "informational text",
          "text structure",
          "text features"
        ]
      }
    },
    {
      "code": "ELA.6.R.2.2",
      "name": "Analyze the central idea(s), implied or explicit, and its development throughout a text.",
      "internal": {
        "clarifications": [
          "Support for a central idea can include an author's use of facts, definitions, concrete details, and/or quotations."
        ],
        "objectives": [
          "Students will be able to identify the central idea of an informational text.",
          "Students will be able to explain how the author develops the central idea with supporting details."
        ],
        "teacher_friendly": "Explain central idea as the main point the author is trying to make. Have students identify the central idea and then find specific facts or examples in the text that support it.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "After reading an article about plastic pollution, what is the author's central idea?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "informational text",
          "central idea"
        ]
      }
    },
    {
      "code": "ELA.6.R.2.3",
      "name": "Analyze authors' purpose(s) in multiple accounts of the same event or topic.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to determine the author's purpose (to inform, persuade, entertain).",
          "Students will be able to compare how different authors treat the same topic."
        ],
        "teacher_friendly": "Have students read two different articles about the same event. Ask them to consider why each author wrote their piece. Is one trying to persuade the reader while the other is just trying to inform?",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "informational text",
          "author's purpose",
          "perspective"
        ]
      }
    },
    {
      "code": "ELA.6.R.2.4",
      "name": "Track the development of an argument, identifying the types of reasoning used.",
      "internal": {
        "clarifications": [
          "Instruction should include an introduction to informal fallacies in reasoning."
        ],
        "objectives": [
          "Students will be able to identify the claim and evidence in an argument.",
          "Students will be able to track how an author builds an argument."
        ],
        "teacher_friendly": "Teach students to identify the author's main claim and then trace the evidence and reasoning used to support it. Introduce basic logical fallacies to help them evaluate the strength of an argument.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "informational text",
          "argument",
          "reasoning"
        ]
      }
    },
    {
      "code": "ELA.6.R.3.1",
      "name": "Explain how figurative language contributes to tone and meaning in text(s).",
      "internal": {
        "clarifications": [
          "Figurative language to be analyzed includes metaphor, simile, alliteration, onomatopoeia, personification, hyperbole, and idiom."
        ],
        "objectives": [
          "Students will be able to identify different types of figurative language.",
          "Students will be able to explain the meaning and effect of figurative language in a text."
        ],
        "teacher_friendly": "Go beyond simple identification. After students find a simile or metaphor, ask 'What feeling or idea does this create? Why did the author choose this comparison?'",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "In the phrase 'the wind whispered through the trees,' what is being personified and what mood does it create?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "figurative language",
          "tone",
          "meaning"
        ]
      }
    },
    {
      "code": "ELA.6.R.3.2",
      "name": "Paraphrase content from grade-level texts.",
      "internal": {
        "clarifications": [
          "Most grade-level texts are appropriate for this standard."
        ],
        "objectives": [
          "Students will be able to restate a passage from a text in their own words."
        ],
        "teacher_friendly": "Teach students a process for paraphrasing: read the passage, cover it up, state the main idea in your own words, and then check for accuracy. Emphasize that paraphrasing is more than just changing a few words.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "paraphrasing",
          "summarizing"
        ]
      }
    },
    {
      "code": "ELA.6.R.3.3",
      "name": "Compare and contrast how authors from different time periods address the same or related topics.",
      "internal": {
        "clarifications": [
          "Texts should be selected from literary periods ranging from the Colonial and Early National Period (1600-1830) to the Contemporary Period (1945-present)."
        ],
        "objectives": [
          "Students will be able to compare texts from different historical periods on the same topic."
        ],
        "teacher_friendly": "Choose a universal theme like 'courage' or 'justice' and pair a classic text with a contemporary one. Use a Venn diagram to help students compare how the topic is treated differently based on the historical context.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "comparative reading",
          "historical context"
        ]
      }
    },
    {
      "code": "ELA.6.R.3.4",
      "name": "Identify rhetorical appeals in a text.",
      "internal": {
        "clarifications": [
          "Students will identify the appeals of logos, ethos, and pathos."
        ],
        "objectives": [
          "Students will be able to define and identify ethos, pathos, and logos in a persuasive text."
        ],
        "teacher_friendly": "Introduce ethos (appeal to credibility/ethics), pathos (appeal to emotion), and logos (appeal to logic) with clear examples from advertisements or speeches. Have students find and label examples in a text.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A commercial showing sad puppies to encourage donations is using which rhetorical appeal?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "reading",
          "rhetoric",
          "ethos",
          "pathos",
          "logos"
        ]
      }
    },
    {
      "code": "ELA.6.V.1.1",
      "name": "Integrate academic vocabulary appropriate to grade level in speaking and writing.",
      "internal": {
        "clarifications": [
          "To integrate vocabulary, students must apply it to authentic tasks independently, beyond just using a word in a sentence."
        ],
        "objectives": [
          "Students will be able to use academic vocabulary correctly in their speaking and writing."
        ],
        "teacher_friendly": "Instead of just memorizing definitions, create activities where students must use new vocabulary words in discussions, debates, or written responses to show their understanding.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "vocabulary",
          "academic language"
        ]
      }
    },
    {
      "code": "ELA.6.V.1.2",
      "name": "Apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to use their knowledge of roots and affixes to decode unfamiliar words."
        ],
        "teacher_friendly": "Teach common roots and affixes explicitly. Have students act as 'word detectives,' breaking down complex words into their meaningful parts.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "If 'bio' means life, what does 'biology' mean?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "vocabulary",
          "morphology",
          "roots",
          "affixes"
        ]
      }
    },
    {
      "code": "ELA.6.V.1.3",
      "name": "Apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to use various strategies (like context clues) to determine the meaning of unknown words.",
          "Students will be able to distinguish between denotation (dictionary definition) and connotation (associated feeling)."
        ],
        "teacher_friendly": "Teach different types of context clues (definition, example, synonym, antonym). For connotation, compare words with similar meanings but different emotional weight, like 'slender' vs. 'scrawny'.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "What is the difference in connotation between the words 'house' and 'home'?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "ela",
          "vocabulary",
          "context clues",
          "connotation",
          "denotation"
        ]
      }
    }
  ]
}
