{
  "subject": "Math",
  "grade": 7,
  "version": "2025.10.10",
  "standards": [
    {
      "code": "MA.7.AR.1.1",
      "name": "Apply properties of operations to add and subtract linear expressions with rational coefficients.",
      "internal": {
        "clarifications": [
          "Instruction includes linear expressions in the form ax±b or b±ax, where a and b are rational numbers.",
          "Refer to Properties of Operations, Equality and Inequality (Appendix D)."
        ],
        "objectives": [
          "Students will be able to add linear expressions with rational coefficients.",
          "Students will be able to subtract linear expressions with rational coefficients by applying properties of operations."
        ],
        "teacher_friendly": "Focus on combining like terms and using the distributive property with rational numbers.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Simplify (0.5x + 1.2) - (0.2x - 0.8)."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "expressions",
          "operations"
        ]
      }
    },
    {
      "code": "MA.7.AR.1.2",
      "name": "Determine whether two linear expressions are equivalent.",
      "internal": {
        "clarifications": [
          "Instruction includes using properties of operations accurately and efficiently.",
          "Instruction includes linear expressions in any form with rational coefficients.",
          "Refer to Properties of Operations, Equality and Inequality (Appendix D)."
        ],
        "objectives": [
          "Students will be able to compare two linear expressions to determine if they are equivalent."
        ],
        "teacher_friendly": "Have students simplify both expressions to their simplest form to see if they match.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Is 2(x + 3) equivalent to 2x + 6?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "expressions",
          "equivalent"
        ]
      }
    },
    {
      "code": "MA.7.AR.2.1",
      "name": "Write and solve one-step inequalities in one variable within a mathematical context and represent solutions algebraically or graphically.",
      "internal": {
        "clarifications": [
          "Instruction focuses on the properties of inequality. Refer to Properties of Operations, Equality and Inequality (Appendix D).",
          "Instruction includes inequalities in the forms px>q; x±p>q; (x/p)>q and p ± x>q, where p and q are specific rational numbers and any inequality symbol can be represented.",
          "Problems include inequalities where the variable may be on either side of the inequality symbol."
        ],
        "objectives": [
          "Students will be able to write one-step inequalities.",
          "Students will be able to solve one-step inequalities.",
          "Students will be able to represent the solution to an inequality on a number line."
        ],
        "teacher_friendly": "Teach students to solve inequalities like equations, but to remember to flip the inequality sign when multiplying or dividing by a negative number.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Solve for x: -3x < 12 and graph the solution."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "inequalities",
          "one-step"
        ]
      }
    },
    {
      "code": "MA.7.AR.2.2",
      "name": "Write and solve two-step equations in one variable within a mathematical or real-world context, where all terms are rational numbers.",
      "internal": {
        "clarifications": [
          "Instruction focuses the application of the properties of equality.",
          "Refer to Properties of Operations, Equality and Inequality (Appendix D).",
          "Instruction includes equations in the forms px±q=r and p(x±q)=r, where p, q and r are specific rational numbers.",
          "Problems include linear equations where the variable may be on either side of the equal sign."
        ],
        "objectives": [
          "Students will be able to write two-step equations from word problems.",
          "Students will be able to solve two-step equations with rational numbers."
        ],
        "teacher_friendly": "Emphasize using inverse operations to isolate the variable, handling addition/subtraction before multiplication/division.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Solve for x: 4x - 7 = 13."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "equations",
          "two-step"
        ]
      }
    },
    {
      "code": "MA.7.AR.3.1",
      "name": "Apply previous understanding of percentages and ratios to solve multi-step real-world percent problems.",
      "internal": {
        "clarifications": [
          "Instruction includes discounts, markups, simple interest, tax, tips, fees, percent increase, percent decrease and percent error."
        ],
        "objectives": [
          "Students will be able to solve real-world problems involving percents, such as calculating discounts, taxes, and tips."
        ],
        "teacher_friendly": "Connect percent problems to real-life situations like shopping or calculating interest to increase engagement.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A shirt costs $25 and is on sale for 20% off. What is the final price after a 6% sales tax?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "percent",
          "ratios"
        ]
      }
    },
    {
      "code": "MA.7.AR.3.2",
      "name": "Apply previous understanding of ratios to solve real-world problems involving proportions.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to set up and solve proportions from real-world scenarios."
        ],
        "teacher_friendly": "Use the cross-multiplication method to solve for unknown values in proportions. Provide examples like scaling a recipe.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "If 3 apples cost $2, how much do 15 apples cost?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportions",
          "ratios"
        ]
      }
    },
    {
      "code": "MA.7.AR.3.3",
      "name": "Solve mathematical and real-world problems involving the conversion of units across different measurement systems.",
      "internal": {
        "clarifications": [
          "Problem types are limited to length, area, weight, mass, volume and money."
        ],
        "objectives": [
          "Students will be able to convert units of measurement between systems (e.g., metric and customary)."
        ],
        "teacher_friendly": "Provide students with a conversion chart and practice setting up proportions or using conversion factors to solve problems.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "How many kilograms are in 50 pounds, if 1 kg is approximately 2.2 pounds?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "conversions",
          "measurement"
        ]
      }
    },
    {
      "code": "MA.7.AR.4.1",
      "name": "Determine whether two quantities have a proportional relationship by examining a table, graph or written description.",
      "internal": {
        "clarifications": [
          "Instruction focuses on the connection to ratios and on the constant of proportionality, which is the ratio between two quantities in a proportional relationship."
        ],
        "objectives": [
          "Students will be able to identify proportional relationships from tables, graphs, and descriptions."
        ],
        "teacher_friendly": "Explain that a relationship is proportional if the graph is a straight line through the origin and the ratio between quantities is constant.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Does a table showing (1, 3), (2, 6), (3, 9) represent a proportional relationship?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportional relationships",
          "graphs",
          "tables"
        ]
      }
    },
    {
      "code": "MA.7.AR.4.2",
      "name": "Determine the constant of proportionality within a mathematical or real-world context given a table, graph or written description of a proportional relationship.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to find the constant of proportionality (unit rate) from a table, graph, or description."
        ],
        "teacher_friendly": "Show students that the constant of proportionality is the value of 'y' when 'x' is 1, or the ratio y/x.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "If a car travels 120 miles in 2 hours, what is the constant of proportionality in miles per hour?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportional relationships",
          "constant of proportionality"
        ]
      }
    },
    {
      "code": "MA.7.AR.4.3",
      "name": "Given a mathematical or real-world context, graph proportional relationships from a table, equation or a written description.",
      "internal": {
        "clarifications": [
          "Instruction includes equations of proportional relationships in the form of y=px, where p is the constant of proportionality."
        ],
        "objectives": [
          "Students will be able to graph a proportional relationship on a coordinate plane."
        ],
        "teacher_friendly": "Remind students that graphs of proportional relationships are straight lines that must pass through the origin (0,0).",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Graph the relationship y = 2x."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportional relationships",
          "graphing"
        ]
      }
    },
    {
      "code": "MA.7.AR.4.4",
      "name": "Given any representation of a proportional relationship, translate the representation to a written description, table or equation.",
      "internal": {
        "clarifications": [
          "Given representations are limited to a written description, graph, table or equation.",
          "Instruction includes equations of proportional relationships in the form of y=px where p is the constant of proportionality."
        ],
        "objectives": [
          "Students will be able to represent a proportional relationship in multiple forms (table, graph, equation, description)."
        ],
        "teacher_friendly": "Practice converting between different forms, such as creating a table of values from an equation or writing an equation from a graph.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Given the points (2, 8) and (3, 12) on a graph, write the equation for the proportional relationship."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportional relationships",
          "representations"
        ]
      }
    },
    {
      "code": "MA.7.AR.4.5",
      "name": "Solve real-world problems involving proportional relationships.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to solve real-world problems using proportional reasoning."
        ],
        "teacher_friendly": "Provide a variety of real-world contexts, such as unit pricing, map scales, or simple interest, to apply proportional relationships.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A map has a scale of 1 inch = 20 miles. If two cities are 5.5 inches apart on the map, what is the actual distance?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "algebraic reasoning",
          "proportional relationships",
          "real-world"
        ]
      }
    },
    {
      "code": "MA.7.DP.1.1",
      "name": "Determine an appropriate measure of center or measure of variation to summarize numerical data, represented numerically or graphically, taking into consideration the context and any outliers.",
      "internal": {
        "clarifications": [
          "Instruction includes recognizing whether a measure of center or measure of variation is appropriate and can be justified based on the given context or the statistical purpose.",
          "Graphical representations are limited to histograms, line plots, box plots and stem-and-leaf plots.",
          "The measure of center is limited to mean and median. The measure of variation is limited to range and interquartile range."
        ],
        "objectives": [
          "Students will be able to choose the best measure of center (mean or median) to describe a data set.",
          "Students will be able to choose the best measure of variation (range or IQR) to describe a data set."
        ],
        "teacher_friendly": "Explain that the median and IQR are better choices when there are outliers, while the mean and range are used for symmetrical data.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "For the data set {5, 6, 7, 8, 50}, would the mean or median be a better measure of center? Why?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "statistics",
          "measure of center",
          "measure of variation"
        ]
      }
    },
    {
      "code": "MA.7.DP.1.2",
      "name": "Given two numerical or graphical representations of data, use the measure(s) of center and measure(s) of variability to make comparisons, interpret results and draw conclusions about the two populations.",
      "internal": {
        "clarifications": [
          "Graphical representations are limited to histograms, line plots, box plots and stem-and-leaf plots.",
          "The measure of center is limited to mean and median. The measure of variation is limited to range and interquartile range."
        ],
        "objectives": [
          "Students will be able to compare two data sets using measures of center and variability.",
          "Students will be able to draw conclusions about two populations based on their data."
        ],
        "teacher_friendly": "Teach students to compare the medians to see which group is typically higher, and compare the IQRs to see which group is more consistent.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Compare the box plots of test scores for two different classes. Which class performed better overall? Which class had more consistent scores?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "statistics",
          "comparing data"
        ]
      }
    },
    {
      "code": "MA.7.DP.1.3",
      "name": "Given categorical data from a random sample, use proportional relationships to make predictions about a population.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to use sample data to make predictions about a larger population."
        ],
        "teacher_friendly": "Explain how to set up a proportion to scale up the results from a sample to the entire population.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "In a random sample of 50 students, 10 said their favorite color is blue. In a school of 500 students, how many would you predict prefer blue?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "samples",
          "predictions"
        ]
      }
    },
    {
      "code": "MA.7.DP.1.4",
      "name": "Use proportional reasoning to construct, display and interpret data in circle graphs.",
      "internal": {
        "clarifications": [
          "Data is limited to no more than 6 categories."
        ],
        "objectives": [
          "Students will be able to calculate the degrees for each sector of a circle graph.",
          "Students will be able to construct and interpret circle graphs."
        ],
        "teacher_friendly": "Teach the process: find the percent for each category, then multiply the percent by 360 degrees to find the angle for each slice.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A survey shows 25% of students prefer pizza. In a circle graph, how many degrees would the 'pizza' sector be?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "circle graphs",
          "proportional reasoning"
        ]
      }
    },
    {
      "code": "MA.7.DP.1.5",
      "name": "Given a real-world numerical or categorical data set, choose and create an appropriate graphical representation.",
      "internal": {
        "clarifications": [
          "Graphical representations are limited to histograms, bar charts, circle graphs, line plots, box plots and stem-and-leaf plots."
        ],
        "objectives": [
          "Students will be able to select the most appropriate type of graph to represent a given data set."
        ],
        "teacher_friendly": "Discuss when to use each type of graph: bar graphs for comparing categories, circle graphs for parts of a whole, histograms for ranges of data, etc.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Which graph would be best to show the percentage of students who own different types of pets?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "graphs",
          "data representation"
        ]
      }
    },
    {
      "code": "MA.7.DP.2.1",
      "name": "Determine the sample space for a simple experiment.",
      "internal": {
        "clarifications": [
          "Simple experiments include tossing a fair coin, rolling a fair die, picking a card randomly from a deck, picking marbles randomly from a bag and spinning a fair spinner."
        ],
        "objectives": [
          "Students will be able to list all possible outcomes of a simple experiment."
        ],
        "teacher_friendly": "Introduce methods for organizing outcomes, such as making a list or a tree diagram, to find the sample space.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "What is the sample space for rolling a standard six-sided die?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "sample space",
          "experiments"
        ]
      }
    },
    {
      "code": "MA.7.DP.2.2",
      "name": "Given the probability of a chance event, interpret the likelihood of it occurring. Compare the probabilities of chance events.",
      "internal": {
        "clarifications": [
          "Instruction includes representing probability as a fraction, percentage or decimal between 0 and 1 with probabilities close to 1 corresponding to highly likely events and probabilities close to 0 corresponding to highly unlikely events.",
          "Instruction includes P(event) notation.",
          "Instruction includes representing probability as a fraction, percentage or decimal."
        ],
        "objectives": [
          "Students will be able to interpret the likelihood of an event based on its probability (impossible, unlikely, likely, certain).",
          "Students will be able to compare the probabilities of two or more events."
        ],
        "teacher_friendly": "Use a number line from 0 (impossible) to 1 (certain) to help students visualize the likelihood of an event.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Is an event with a probability of 0.8 more or less likely than an event with a probability of 3/4?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "likelihood"
        ]
      }
    },
    {
      "code": "MA.7.DP.2.3",
      "name": "Find the theoretical probability of an event related to a simple experiment.",
      "internal": {
        "clarifications": [
          "Instruction includes representing probability as a fraction, percentage or decimal.",
          "Simple experiments include tossing a fair coin, rolling a fair die, picking a card randomly from a deck, picking marbles randomly from a bag and spinning a fair spinner."
        ],
        "objectives": [
          "Students will be able to calculate the theoretical probability of an event."
        ],
        "teacher_friendly": "Emphasize the formula: P(event) = (number of favorable outcomes) / (total number of possible outcomes).",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "What is the theoretical probability of rolling an even number on a six-sided die?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "theoretical probability"
        ]
      }
    },
    {
      "code": "MA.7.DP.2.4",
      "name": "Use a simulation of a simple experiment to find experimental probabilities and compare them to theoretical probabilities.",
      "internal": {
        "clarifications": [
          "Instruction includes representing probability as a fraction, percentage or decimal.",
          "Instruction includes recognizing that experimental probabilities may differ from theoretical probabilities due to random variation. As the number of repetitions increases experimental probabilities will typically better approximate the theoretical probabilities.",
          "Experiments include tossing a fair coin, rolling a fair die, picking a card randomly from a deck, picking marbles randomly from a bag and spinning a fair spinner."
        ],
        "objectives": [
          "Students will be able to find the experimental probability of an event.",
          "Students will be able to compare experimental and theoretical probabilities."
        ],
        "teacher_friendly": "Conduct a simple experiment in class, like flipping a coin 50 times, to show how experimental probability gets closer to theoretical probability with more trials.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "If you roll a die 20 times and get a '4' three times, what is the experimental probability? How does it compare to the theoretical probability?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "data analysis",
          "probability",
          "experimental probability",
          "simulations"
        ]
      }
    },
    {
      "code": "MA.7.GR.1.1",
      "name": "Apply formulas to find the areas of trapezoids, parallelograms and rhombi.",
      "internal": {
        "clarifications": [
          "Instruction focuses on the connection from the areas of trapezoids, parallelograms and rhombi to the areas of rectangles or triangles.",
          "Within this benchmark, the expectation is not to memorize area formulas for trapezoids, parallelograms and rhombi."
        ],
        "objectives": [
          "Students will be able to calculate the area of trapezoids, parallelograms, and rhombi using given formulas."
        ],
        "teacher_friendly": "Show how these shapes can be decomposed into rectangles and triangles to help students understand where the formulas come from.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Find the area of a parallelogram with a base of 10 cm and a height of 5 cm."
        ],
        "exclusions": [
          "Memorizing formulas."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "area",
          "trapezoid",
          "parallelogram",
          "rhombus"
        ]
      }
    },
    {
      "code": "MA.7.GR.1.2",
      "name": "Solve mathematical or real-world problems involving the area of polygons or composite figures by decomposing them into triangles or quadrilaterals.",
      "internal": {
        "clarifications": [
          "Within this benchmark, the expectation is not to find areas of figures on the coordinate plane or to find missing dimensions."
        ],
        "objectives": [
          "Students will be able to find the area of composite figures by breaking them into simpler shapes."
        ],
        "teacher_friendly": "Teach students to 'slice' complex shapes into familiar ones like rectangles and triangles, find the area of each part, and add them together.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Find the area of an L-shaped room by splitting it into two rectangles."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "area",
          "composite figures",
          "decomposition"
        ]
      }
    },
    {
      "code": "MA.7.GR.1.3",
      "name": "Explore the proportional relationship between circumferences and diameters of circles. Apply a formula for the circumference of a circle to solve mathematical and real-world problems.",
      "internal": {
        "clarifications": [
          "Instruction includes the exploration and analysis of circular objects to examine the proportional relationship between circumference and diameter and arrive at an approximation of pi (π) as the constant of proportionality.",
          "Solutions may be represented in terms of pi (π) or approximately."
        ],
        "objectives": [
          "Students will be able to explain the relationship between circumference, diameter, and pi.",
          "Students will be able to calculate the circumference of a circle."
        ],
        "teacher_friendly": "Use a hands-on activity with circular objects, string, and rulers to help students discover the value of pi.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Find the circumference of a circle with a diameter of 10 inches, both in terms of π and as an approximation."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "circles",
          "circumference",
          "pi"
        ]
      }
    },
    {
      "code": "MA.7.GR.1.4",
      "name": "Explore and apply a formula to find the area of a circle to solve mathematical and real-world problems.",
      "internal": {
        "clarifications": [
          "Instruction focuses on the connection between formulas for the area of a rectangle and the area of a circle.",
          "Problem types include finding areas of fractional parts of a circle.",
          "Solutions may be represented in terms of pi (π) or approximately."
        ],
        "objectives": [
          "Students will be able to calculate the area of a circle.",
          "Students will be able to find the area of sectors of a circle."
        ],
        "teacher_friendly": "Use the formula A = πr² and ensure students know the difference between radius and diameter. Practice with problems involving whole and partial circles.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "What is the area of a pizza with a 14-inch diameter? What is the area of one slice if it's cut into 8 equal slices?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "circles",
          "area",
          "pi"
        ]
      }
    },
    {
      "code": "MA.7.GR.1.5",
      "name": "Solve mathematical and real-world problems involving dimensions and areas of geometric figures, including scale drawings and scale factors.",
      "internal": {
        "clarifications": [
          "Instruction focuses on seeing the scale factor as a constant of proportionality between corresponding lengths in the scale drawing and the original object.",
          "Instruction includes the understanding that if the scaling factor is k, then the constant of proportionality between corresponding areas is k².",
          "Problem types include finding the scale factor given a set of dimensions as well as finding dimensions when given a scale factor."
        ],
        "objectives": [
          "Students will be able to use scale factors to find missing dimensions in similar figures.",
          "Students will be able to solve problems involving scale drawings and their areas."
        ],
        "teacher_friendly": "Explain that lengths are multiplied by the scale factor (k), but areas are multiplied by the scale factor squared (k²).",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A blueprint has a scale factor of 1:20. If a room is 5 inches by 7 inches on the blueprint, what is its actual area?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "scale drawings",
          "scale factor",
          "area"
        ]
      }
    },
    {
      "code": "MA.7.GR.2.1",
      "name": "Given a mathematical or real-world context, find the surface area of a right circular cylinder using the figure's net.",
      "internal": {
        "clarifications": [
          "Instruction focuses on representing a right circular cylinder with its net and on the connection between surface area of a figure and its net.",
          "Within this benchmark, the expectation is to find the surface area when given a net or when given a three-dimensional figure.",
          "Within this benchmark, the expectation is not to memorize the surface area formula for a right circular cylinder.",
          "Solutions may be represented in terms of pi (π) or approximately."
        ],
        "objectives": [
          "Students will be able to find the surface area of a cylinder by analyzing its net (two circles and a rectangle)."
        ],
        "teacher_friendly": "Help students visualize 'unrolling' a cylinder to see its net. The surface area is the area of the two circular bases plus the area of the rectangular side.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "A can has a radius of 2 inches and a height of 5 inches. Find its surface area."
        ],
        "exclusions": [
          "Memorizing the surface area formula."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "3d figures",
          "surface area",
          "cylinders",
          "nets"
        ]
      }
    },
    {
      "code": "MA.7.GR.2.2",
      "name": "Solve real-world problems involving surface area of right circular cylinders.",
      "internal": {
        "clarifications": [
          "Within this benchmark, the expectation is not to memorize the surface area formula for a right circular cylinder or to find radius as a missing dimension.",
          "Solutions may be represented in terms of pi (π) or approximately."
        ],
        "objectives": [
          "Students will be able to apply the concept of surface area of cylinders to solve real-world problems."
        ],
        "teacher_friendly": "Use practical examples like finding the amount of material needed to make a label for a can or paint a silo.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "How much paper is needed to create a label for a soup can that is 10 cm tall and has a diameter of 6 cm?"
        ],
        "exclusions": [
          "Memorizing formulas."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "3d figures",
          "surface area",
          "cylinders"
        ]
      }
    },
    {
      "code": "MA.7.GR.2.3",
      "name": "Solve mathematical and real-world problems involving volume of right circular cylinders.",
      "internal": {
        "clarifications": [
          "Within this benchmark, the expectation is not to memorize the volume formula for a right circular cylinder or to find radius as a missing dimension.",
          "Solutions may be represented in terms of pi (π) or approximately."
        ],
        "objectives": [
          "Students will be able to calculate the volume of a cylinder."
        ],
        "teacher_friendly": "Explain volume as the area of the base multiplied by the height. For a cylinder, this is the area of the circle times the cylinder's height.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "How much water can a cylindrical pool hold if it has a radius of 10 feet and a depth of 4 feet?"
        ],
        "exclusions": [
          "Memorizing formulas."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "geometry",
          "3d figures",
          "volume",
          "cylinders"
        ]
      }
    },
    {
      "code": "MA.7.NSO.1.1",
      "name": "Know and apply the Laws of Exponents to evaluate numerical expressions and generate equivalent numerical expressions, limited to whole-number exponents and rational number bases.",
      "internal": {
        "clarifications": [
          "Instruction focuses on building the Laws of Exponents from specific examples.",
          "Refer to the K-12 Formulas (Appendix E) for the Laws of Exponents.",
          "Problems in the form a^m / a^n = a^p must result in a whole-number value for p."
        ],
        "objectives": [
          "Students will be able to use the Laws of Exponents to simplify and evaluate numerical expressions."
        ],
        "teacher_friendly": "Introduce exponent rules one at a time (product, quotient, power of a power) with simple examples before combining them.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Simplify (2^3) * (2^4)."
        ],
        "exclusions": [
          "Negative or fractional exponents."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "number sense",
          "operations",
          "exponents",
          "laws of exponents"
        ]
      }
    },
    {
      "code": "MA.7.NSO.1.2",
      "name": "Rewrite rational numbers in different but equivalent forms including fractions, mixed numbers, repeating decimals and percentages to solve mathematical and real-world problems.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to convert between fractions, decimals, and percents."
        ],
        "teacher_friendly": "Practice converting between forms and discuss when one form might be more useful than another (e.g., percents for discounts, fractions for recipes).",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Express 5/8 as a decimal and a percent."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "number sense",
          "operations",
          "rational numbers",
          "conversions"
        ]
      }
    },
    {
      "code": "MA.7.NSO.2.1",
      "name": "Solve mathematical problems using multi-step order of operations with rational numbers including grouping symbols, whole-number exponents and absolute value.",
      "internal": {
        "clarifications": [
          "Multi-step expressions are limited to 6 or fewer steps."
        ],
        "objectives": [
          "Students will be able to apply the order of operations to solve expressions with rational numbers."
        ],
        "teacher_friendly": "Reinforce PEMDAS (or GEMA) with examples that include fractions, decimals, absolute value, and exponents.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Evaluate: 3 * | -2 - 5 | + (1/2)^2"
        ],
        "exclusions": [
          "Expressions with more than 6 steps."
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "number sense",
          "operations",
          "order of operations",
          "rational numbers"
        ]
      }
    },
    {
      "code": "MA.7.NSO.2.2",
      "name": "Add, subtract, multiply and divide rational numbers with procedural fluency.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to perform all four basic operations with fractions and decimals fluently."
        ],
        "teacher_friendly": "Provide regular practice with operations on positive and negative fractions and decimals to build fluency.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Calculate (-3/4) / (1/2)."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "number sense",
          "operations",
          "rational numbers",
          "fluency"
        ]
      }
    },
    {
      "code": "MA.7.NSO.2.3",
      "name": "Solve real-world problems involving any of the four operations with rational numbers.",
      "internal": {
        "clarifications": [
          "Instruction includes using one or more operations to solve problems."
        ],
        "objectives": [
          "Students will be able to solve multi-step real-world problems involving operations with rational numbers."
        ],
        "teacher_friendly": "Use word problems that require multiple steps and involve both fractions and decimals in contexts like finance, cooking, or measurement.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "You have $20.50. You buy a book for $8.75 and a snack for $3.25. How much money do you have left?"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "number sense",
          "operations",
          "rational numbers",
          "real-world"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.1.1",
      "name": "Actively participate in effortful learning both individually and collectively.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to participate actively in effortful learning both individually and with others: Cultivate a community of growth mindset learners.",
          "Foster perseverance in students by choosing tasks that are challenging.",
          "Develop students' ability to analyze and problem solve.",
          "Recognize students' effort when solving challenging problems."
        ],
        "objectives": [
          "Students will engage in challenging tasks.",
          "Students will demonstrate perseverance and a growth mindset."
        ],
        "teacher_friendly": "Encourage a classroom culture where students are not afraid to make mistakes and are praised for their effort and persistence.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "growth mindset"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.2.1",
      "name": "Demonstrate understanding by representing problems in multiple ways.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to demonstrate understanding by representing problems in multiple ways: Help students make connections between concepts and representations.",
          "Provide opportunities for students to use manipulatives when investigating concepts.",
          "Guide students from concrete to pictorial to abstract representations as understanding progresses.",
          "Show students that various representations can have different purposes and can be useful in different situations."
        ],
        "objectives": [
          "Students will be able to represent a mathematical problem using graphs, tables, equations, or diagrams."
        ],
        "teacher_friendly": "Ask students to solve a problem one way, then challenge them to solve it a different way and explain the connection.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "representations"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.3.1",
      "name": "Complete tasks with mathematical fluency.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to complete tasks with mathematical fluency: Provide students with the flexibility to solve problems by selecting a procedure that allows them to solve efficiently and accurately.",
          "Offer multiple opportunities for students to practice efficient and generalizable methods.",
          "Provide opportunities for students to reflect on the method they used and determine if a more efficient method could have been used."
        ],
        "objectives": [
          "Students will be able to solve problems accurately and efficiently.",
          "Students will be able to select appropriate methods for solving problems."
        ],
        "teacher_friendly": "Encourage practice of basic skills and provide opportunities for students to discuss and compare different solution strategies.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "fluency"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.4.1",
      "name": "Engage in discussions that reflect on the mathematical thinking of self and others.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to engage in discussions that reflect on the mathematical thinking of self and others: Establish a culture in which students ask questions of the teacher and their peers, and error is an opportunity for learning.",
          "Create opportunities for students to discuss their thinking with peers.",
          "Select, sequence and present student work to advance and deepen understanding of correct and increasingly efficient methods.",
          "Develop students' ability to justify methods and compare their responses to the responses of their peers."
        ],
        "objectives": [
          "Students will be able to explain their mathematical reasoning.",
          "Students will be able to critique the reasoning of others."
        ],
        "teacher_friendly": "Use 'think-pair-share' or small group discussions to have students explain their problem-solving process and justify their answers.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "discussion"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.5.1",
      "name": "Use patterns and structure to help understand and connect mathematical concepts.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to use patterns and structure to help understand and connect mathematical concepts: Help students recognize the patterns in the world around them and connect these patterns to mathematical concepts.",
          "Support students to develop generalizations based on the similarities found among problems.",
          "Provide opportunities for students to create plans and procedures to solve problems.",
          "Develop students' ability to construct relationships between their current understanding and more sophisticated ways of thinking."
        ],
        "objectives": [
          "Students will be able to identify and use patterns to solve problems.",
          "Students will be able to recognize mathematical structures."
        ],
        "teacher_friendly": "Prompt students with questions like 'What do you notice?' or 'Is there a shortcut?' to help them see underlying patterns and structures.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "patterns",
          "structure"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.6.1",
      "name": "Assess the reasonableness of solutions.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to assess the reasonableness of solutions: Have students estimate or predict solutions prior to solving.",
          "Prompt students to continually ask, 'Does this solution make sense? How do you know?'",
          "Reinforce that students check their work as they progress within and after a task.",
          "Strengthen students' ability to verify solutions through justifications."
        ],
        "objectives": [
          "Students will be able to estimate solutions.",
          "Students will be able to evaluate whether their answer is reasonable in the context of the problem."
        ],
        "teacher_friendly": "Encourage students to make an estimate before solving and then compare their final answer to their estimate.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "estimation"
        ]
      }
    },
    {
      "code": "MA.K12.MTR.7.1",
      "name": "Apply mathematics to real-world contexts.",
      "internal": {
        "clarifications": [
          "Teachers who encourage students to apply mathematics to real-world contexts: Provide opportunities for students to create models, both concrete and abstract, and perform investigations.",
          "Challenge students to question the accuracy of their models and methods.",
          "Support students as they validate conclusions by comparing them to the given situation.",
          "Indicate how various concepts can be applied to other disciplines."
        ],
        "objectives": [
          "Students will be able to connect mathematical concepts to real-world situations."
        ],
        "teacher_friendly": "Use real-world data and scenarios to frame mathematical problems, helping students see the relevance of what they are learning.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "mathematical thinking",
          "reasoning",
          "real-world application"
        ]
      }
    }
  ]
}
