{
  "subject": "U.S. History",
  "grade": 6,
  "version": "2025.10.10",
  "standards": [
    {
      "code": "SS.68.AA.1.1",
      "name": "Identify Afro-Eurasian trade routes and methods prior to the development of the Atlantic slave trade.",
      "internal": {
        "clarifications": [
          "Instruction includes how slavery was utilized in Asian, European and African cultures.",
          "Instruction includes the similarities and differences between serfdom and slavery.",
          "Instruction includes the use of maps to identify trade routes."
        ],
        "objectives": [
          "Students will be able to identify major pre-Atlantic trade routes like the Silk Road and Trans-Saharan routes.",
          "Students will be able to understand that forms of slavery existed in various cultures before the Atlantic slave trade."
        ],
        "teacher_friendly": "Use maps to show that complex trade networks existed long before European exploration. Discuss how earlier forms of slavery were often not chattel slavery based on race.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Compare a map of the Silk Road to a map of the Trans-Saharan trade routes."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "trade routes",
          "world history"
        ]
      }
    },
    {
      "code": "SS.68.AA.1.2",
      "name": "Describe the contact of European explorers with systematic slave trading in Africa.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to describe how European demand for labor in the Americas transformed the existing slave trade in Africa."
        ],
        "teacher_friendly": "Explain that while slavery existed in Africa, the immense European demand for labor on colonial plantations created the brutal, large-scale system known as the Atlantic slave trade.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "atlantic slave trade",
          "exploration"
        ]
      }
    },
    {
      "code": "SS.68.AA.1.3",
      "name": "Examine the evolution of the labor force in the use of indentured servitude contracts.",
      "internal": {
        "clarifications": [
          "Instruction includes the comparative treatment of indentured servants of European and African extraction.",
          "Instruction includes the transition from an indentured to a slave-based economy."
        ],
        "objectives": [
          "Students will be able to define indentured servitude.",
          "Students will be able to explain why the colonial labor system shifted from indentured servitude to chattel slavery."
        ],
        "teacher_friendly": "Explain indentured servitude as a temporary labor contract. Discuss how the desire for a permanent, exploitable labor force led colonies, especially in the South, to transition to a system of lifelong, race-based slavery.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "colonial america",
          "indentured servitude",
          "slavery"
        ]
      }
    },
    {
      "code": "SS.68.AA.1.4",
      "name": "Describe the history and evolution of slave codes.",
      "internal": {
        "clarifications": [
          "Instruction includes judicial and legislative actions concerning slavery."
        ],
        "objectives": [
          "Students will be able to define slave codes.",
          "Students will be able to explain how slave codes were used to control the enslaved population."
        ],
        "teacher_friendly": "Explain slave codes as laws created to enforce the system of slavery, stripping enslaved people of their rights and humanity. Provide examples of what these codes prohibited (e.g., learning to read, gathering in groups).",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "slave codes",
          "law"
        ]
      }
    },
    {
      "code": "SS.68.AA.1.5",
      "name": "Analyze slave revolts that happened in early colonial America and how political leaders reacted (e.g., 1712 revolt in New York City, Stono Rebellion [1739]).",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to identify examples of slave revolts in colonial America.",
          "Students will be able to explain that a common reaction to revolts was the creation of even harsher slave codes."
        ],
        "teacher_friendly": "Use examples like the Stono Rebellion to show that enslaved people actively resisted bondage. Explain the cause-and-effect relationship: resistance and revolts led fearful white leaders to enact stricter and more brutal slave codes.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "resistance",
          "slave revolts"
        ]
      }
    },
    {
      "code": "SS.68.AA.1.6",
      "name": "Examine the service and sacrifice of African patriots during the Revolutionary Era (e.g., Crispus Attucks, Peter Salem, James Armistead Lafayette, 1st Rhode Island Regiment).",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to identify African American patriots who contributed to the Revolutionary War."
        ],
        "teacher_friendly": "Highlight the stories of Black patriots to show that the fight for American independence included people who were also fighting for their own freedom from slavery.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Research the story of James Armistead Lafayette and his role as a spy for the Continental Army."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "american revolution",
          "patriots"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.1",
      "name": "Explain early congressional actions regarding the institution of slavery (i.e., Northwest Ordinance of 1787, Three-Fifths Compromise, Act Prohibiting Importation of Slaves of 1808).",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to describe how the new U.S. government addressed the issue of slavery in its early laws and compromises."
        ],
        "teacher_friendly": "Discuss the conflicting actions of the early government: while the Northwest Ordinance banned slavery in new northern territories, the Three-Fifths Compromise protected it in the Constitution for the sake of unity.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "constitution",
          "compromise"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.2",
      "name": "Explain the effect of the cotton industry on the expansion of slavery due to Eli Whitney’s Cotton Gin.",
      "internal": {
        "clarifications": [
          "Instruction includes the use of a map to show westward expansion."
        ],
        "objectives": [
          "Students will be able to explain how the cotton gin increased the demand for enslaved labor and land."
        ],
        "teacher_friendly": "Explain the irony of the cotton gin: this labor-saving device made cotton so profitable that it dramatically increased the South's reliance on enslaved people to grow and pick more cotton, fueling westward expansion.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "cotton gin",
          "westward expansion"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.3",
      "name": "Examine the various duties and trades performed by slaves (e.g., agricultural work, painting, carpentry, tailoring, domestic service, blacksmithing, transportation).",
      "internal": {
        "clarifications": [
          "Instruction includes how slaves developed skills which, in some instances, could be applied for their personal benefit."
        ],
        "objectives": [
          "Students will be able to identify a wide range of skilled and unskilled labor performed by enslaved people.",
          "Students will understand that some enslaved individuals developed valuable skills."
        ],
        "teacher_friendly": "Challenge the misconception that all enslaved people worked only in fields; highlight the skilled artisans, domestic workers, and tradespeople within the enslaved population, and note how these skills were sometimes used to earn money or purchase freedom.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Research the role of enslaved blacksmiths on a plantation and their importance to the economy."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "skilled labor"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.4",
      "name": "Examine the Underground Railroad and its importance to those seeking freedom.",
      "internal": {
        "clarifications": [
          "Instruction includes how collaboration of free blacks, whites, churches and organizations assisted in the Underground Railroad (e.g., Harriet Tubman, William Lambert, Levi Coffin, William Still).",
          "Instruction includes the use of “spirituals” and symbols as a form of communication, coordination, coding and expression."
        ],
        "objectives": [
          "Students will be able to describe the purpose and function of the Underground Railroad.",
          "Students will be able to identify key figures and methods used in the Underground Railroad."
        ],
        "teacher_friendly": "Explain the Underground Railroad as a network of secret routes and safe houses, not a real railroad. Highlight the bravery of conductors like Harriet Tubman and the creative use of coded messages in songs and quilts.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "slavery",
          "underground railroad",
          "abolition"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.5",
      "name": "Identify political figures who strove to abolish the institution of slavery (e.g., Thaddeus Stevens, Abraham Lincoln, Zachariah Chandler).",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to identify key political abolitionists."
        ],
        "teacher_friendly": "Discuss the roles of different political figures, from Radical Republicans like Thaddeus Stevens who pushed for immediate abolition, to Abraham Lincoln, whose views on slavery evolved toward emancipation during the Civil War.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "abolition",
          "civil war",
          "lincoln"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.6",
      "name": "Evaluate various abolitionist movements that continuously pushed to end slavery.",
      "internal": {
        "clarifications": [
          "Instruction includes the Society of Friends (Quakers) and their efforts to end slavery throughout the United States.",
          "Instruction includes writings by Africans living in the United States and their effect on the abolitionist movement (e.g., Sojourner Truth, Frederick Douglass, William Wells Brown, David Walker, Martin Delaney)."
        ],
        "objectives": [
          "Students will be able to identify different groups and individuals in the abolitionist movement.",
          "Students will be able to describe the methods used by abolitionists, such as writing and public speaking."
        ],
        "teacher_friendly": "Show that the abolitionist movement was diverse, including religious groups like the Quakers, and was powerfully led by formerly enslaved people like Frederick Douglass and Sojourner Truth who used their writing and speeches to expose the evils of slavery.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "Read an excerpt from an autobiography by Frederick Douglass."
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "abolition",
          "frederick douglass"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.7",
      "name": "Examine how the status of slaves, those who had escaped slavery and free blacks, affected their contributions to the Civil War effort.",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to compare the different ways African Americans contributed to the Civil War effort."
        ],
        "teacher_friendly": "Discuss the varied roles of African Americans in the Civil War, from enslaved people escaping to Union lines and providing intelligence, to free Black men joining the Union Army and fighting in segregated regiments like the 54th Massachusetts.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "civil war",
          "usct"
        ]
      }
    },
    {
      "code": "SS.68.AA.2.8",
      "name": "Describe significant contributions made by key figures during Reconstruction (e.g., President Ulysses S. Grant, Secretary of War Edwin Stanton, Frederick Douglass, Lyman Trumbull).",
      "internal": {
        "clarifications": [
          "N/A"
        ],
        "objectives": [
          "Students will be able to identify key figures of the Reconstruction era and their contributions."
        ],
        "teacher_friendly": "Highlight the efforts of figures who worked to enforce Reconstruction and protect civil rights, such as President Grant's actions against the KKK and Frederick Douglass's continued advocacy for equality.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "african american history",
          "reconstruction",
          "key figures"
        ]
      }
    },
    {
      "code": "SS.68.HE.1.1",
      "name": "Examine the Holocaust as the planned and systematic state-sponsored persecution and murder of European Jews by Nazi Germany and its collaborators between 1933 and 1945.",
      "internal": {
        "clarifications": [
          "Students will describe the basic beliefs of Judaism and trace the origins and history of Jews in Europe.",
          "Students will analyze how antisemitism led to and contributed to the Holocaust.",
          "Students will identify examples of antisemitism (e.g., making mendacious, dehumanizing, demonizing or stereotypical allegations about Jews; demonizing Israel by using the symbols and images associated with classic antisemitism to characterize Israel or Israelis)."
        ],
        "objectives": [
          "Students will be able to define the Holocaust.",
          "Students will be able to explain the role of antisemitism in causing the Holocaust."
        ],
        "teacher_friendly": "Provide historical context for the Holocaust, defining antisemitism and tracing its roots in Europe. Emphasize that it was a systematic, government-planned genocide.",
        "item_specs": {
          "eligible_content": "N/A",
          "stimulus": "N/A",
          "response_attributes": "N/A",
          "cognitive_complexity": "N/A"
        },
        "examples": [
          "N/A"
        ],
        "exclusions": [
          "N/A"
        ],
        "crosswalk": {
          "legacy": "N/A"
        },
        "tags": [
          "holocaust education",
          "world history",
          "genocide",
          "antisemitism"
        ]
      }
    }
  ]
}
